# Оператор условия if else

# if условие:
#     код если условие истино
# else:
#     код если условие ложно

# if 5>6:
#     print('5>6')
# else:
#     print('неправильно!')

# if True:
#     print('5>6')
# else:
#     print('неправильно!')

# _______________________________ 

# Оператор or 
# num = int(input('Введие число: '))
# if num > 0 or num == 0:
#     print('Число больше 0, True')
# else:
#     print('чсло меньше 0, False')

# _______________________________ 

# Оператор and 
# if 5>2 and 5>3:
#     print('True')
# else:
#     print('False')

# _______________________________ 

# Оператор in 
# words = "Hello world"

# if 'e' in words:
#     print('True')
# else:
#     print('False')

# _______________________________ 

# Оператор != не равно

# if 20 != 1:
#     print("True")
# else:
#     print("False")

# _______________________________ 

# age = int(input("Введите ваш возраст: "))

# if age <= 18:
#     print("Вход запрещен.")
# else:
#     print("Добро пожаловать!")

# _______________________________ 

# a = int(input())

# even = 0
# odd = 0

# while a > 0:
#     if a % 2 == 0:
#         even += 1
#     else:
#         odd += 1
#     a = a // 10

# print(f'четное: {even}, не четное: {odd}')

# _____________________________________________ 
# ___________________________________________________

# Напишите программу, которая запрашивает у 
# пользователя год и определяет, является ли этот год високосным.

# a = int(input('Введите год: '))
# print(a)

# year = int(input('Введите год: '))

# _____________________________________________ 

# Оператор is и is not 

# num = [1, 2, 3]
# num2 = [1, 2, 3]

# if num is not num2:
#     print('True')
# else:
#     print('False')

# _____________________________________________ 

# if 5>0:
#     print('True')
# elif 5<0:
#     print('False')
# else:
#     print('вообще нет ответа!!!')

# _____________________________________________ 

# not False == True 
# not True == False 