# цикл for 

# for переменная in объект итерации:
#     действие с переменной 

# fruits = ['apple', 'orange', 'babnana', 'melon']

# for i in fruits:
#     print(i)

# ___________________________________________________

# for i in 'Hello':
#     print(i)

# ___________________________________________________

# a = ['123']

# for i in a:
#     print(float(i))

# ___________________________________________________

# numbers = [1,2,3,4,5]
# fruits = ['apple', 'orange', 'babnana', 'melon']

# for _ in numbers:
#     print(fruits)

# ___________________________________________________

# numbers = [1,2,3,4,5]
# fruits = ['apple', 'orange', 'babnana', 'melon']

# for index, fruit in enumerate(fruits):
#     print(f"Index {index}: {fruit}")

# ___________________________________________________

# RANGE
# for i in range(2,10,2): # (начало:конец:шаг)
#     print(i)

# ___________________________________________________

# RANGE
# for i in range(1,5): # (начало:конец:шаг)
#     print("Привет! Как дела?")

# ___________________________________________________

# fruits = ['apple', 'orange', 'babnana', 'melon']

# for i in fruits:
#     print(i.capitalize())

# ___________________________________________________

# a = int(input("Введите число: "))

# for i in range(10):
#     print(i * 5)
# ___________________________________________________________________________________

# Напишите программу таблицу умножения на 5

# for a in range(1,10):
#     print(f'{a} x 5 = {a*5}')

# ___________________________________________________________________________________

# numbers = [10, 20, 30, 40, 50]

# total = 0

# for num in numbers:
#     total += num

# print("Сумма всех чисел в списке:", total)

# ___________________________________________________________________________________

# Напишите программу, которая вычисляет сумму всех чисел в заданном списке.

# summa = 0

# for num in range(1,10):
#     # summa =  summa + num # это одно и тоже summa += num
#     summa += num
#     print(summa)

# ___________________________________________________

# Напишите программу, которая считает количество гласных (a, e, i, o, u) в заданной строке.

# a = [a, e, i, o, u]

# word = input('Введите слово: ')
# count = 0
# glasnye = 'AYOUEaouei'

# for i in word:
#     if i in glasnye:
#         count += 1
#         print(i)
    
# ___________________________________________________

# count = 0

# for i in 'Hanasfasfas':
#     if i in 'AOUEIaouei':
#         count = count + 1

# print(count)

# ___________________________________________________



